[
  {"fact": "The first computer bug was a moth found in Harvard Mark II in 1947."},
  {"fact": "Ray Tomlinson sent the first email in 1971 and chose the '@' symbol."},
  {"fact": "The first website was launched by Tim Berners-Lee on August 6, 1991 at CERN."},
  {"fact": "Google was originally called 'Backrub' in 1996 before being renamed."},
  {"fact": "IBM introduced the first 1GB hard drive in 1980 — it weighed over 500 pounds."},
  {"fact": "Wi-Fi doesn’t stand for Wireless Fidelity — it was just a brand name."},
  {"fact": "The first computer virus for MS-DOS, called 'Brain', was released in 1986."},
  {"fact": "Amazon started as an online bookstore in 1995."},
  {"fact": "IBM created the first smartphone in 1992, called Simon Personal Communicator."},
  {"fact": "USB was first introduced in 1996, revolutionizing device connectivity."},
  {"fact": "The first YouTube video was uploaded on April 23, 2005 — 'Me at the zoo'."},
  {"fact": "Microsoft Windows 1.0 was released in 1985."},
  {"fact": "The Apollo Guidance Computer had only 64 KB of memory."},
  {"fact": "Apple's first logo featured Isaac Newton sitting under a tree."},
  {"fact": "The floppy disk was invented by IBM in 1971."},
  {"fact": "CAPTCHA stands for 'Completely Automated Public Turing test to tell Computers and Humans Apart'."},
  {"fact": "The first domain name ever registered was Symbolics.com in 1985."},
  {"fact": "Bluetooth is named after a 10th-century Scandinavian king, Harald Bluetooth."},
  {"fact": "The first Apple iPhone was released in 2007."},
  {"fact": "Elon Musk’s first company was Zip2, founded in 1995."},
  {"fact": "Email existed before the World Wide Web was invented."},
  {"fact": "NASA used punch cards for Apollo missions."},
  {"fact": "The first webcam was invented at Cambridge University to monitor a coffee pot."},
  {"fact": "Mozilla Firefox was originally called Phoenix."},
  {"fact": "Linux was created in 1991 by Linus Torvalds."},
  {"fact": "CDs can store about 700 MB of data — roughly 80 minutes of music."},
  {"fact": "The first text message ever sent was 'Merry Christmas' in 1992."},
  {"fact": "TikTok was launched in 2016 as Douyin in China."},
  {"fact": "The first computer mouse was made of wood in 1964 by Douglas Engelbart."},
  {"fact": "Bitcoin, the first cryptocurrency, was launched in 2009."}
]
